---
layout: default
title: Float
nav_order: 2
description: 'Float Graph Type for PostGraph'
toc_max_heading_level: 2
---
# Introduction

A float in PostGraph is an 8-byte inexact variable-precise number. It offers 15 decimal digits of precision.

The data type double precision are inexact, variable-precision numeric types. On all currently supported platforms, these types are implementations of IEEE Standard 754 for Binary Floating-Point Arithmetic, to the extent that the underlying processor, operating system, and compiler support it.

Inexact means that some values cannot be converted exactly to the internal format and are stored as approximations, so that storing and retrieving a value might show slight discrepancies. Managing these errors and how they propagate through calculations is the subject of an entire branch of mathematics and computer science and will not be discussed here, except for the following points:

- If you require exact storage and calculations (such as for monetary amounts), use the numeric type instead.
- If you want to do complicated calculations with these types for anything important, especially if you rely on certain behavior in boundary cases (infinity, underflow), you should evaluate the implementation carefully.
- Comparing two floating-point values for equality might not always work as expected.

On all currently supported platforms, the `double precision` type has a range of around 1E-307 to 1E+308 with a precision of at least 15 digits. Values that are too large or too small will cause an error. Rounding might take place if the precision of an input number is too high. Numbers too close to zero that are not representable as distinct from zero will cause an underflow error.

By default, floating point values are output in text form in their shortest precise decimal representation; the decimal value produced is closer to the true stored binary value than to any other value representable in the same binary precision. (However, the output value is currently never exactly midway between two representable values, in order to avoid a widespread bug where input routines do not properly respect the round-to-nearest-even rule.) This value will use at most 17 significant decimal digits for float8 values, and at most 9 digits for float4 values.

:::note
This shortest-precise output format is much faster to generate than the historical rounded format.
:::

For compatibility with output generated by older versions of PostgreSQL, and to allow the output precision to be reduced, the `extra_float_digits` parameter can be used to select rounded decimal output instead. Setting a value of 0 restores the previous default of rounding the value to 6 (for float4) or 15 (for float8) significant decimal digits. Setting a negative value reduces the number of digits further; for example -2 would round output to 4 or 13 digits respectively.

Any value of `extra_float_digits` greater than 0 selects the shortest-precise format.

:::note
Applications that wanted precise values have historically had to set `extra_float_digits` to 3 to obtain them. For maximum compatibility between versions, they should continue to do so.
:::

In addition to ordinary numeric values, the floating-point types have several special values:
`Infinity`
`-Infinity`
`NaN`

These represent the IEEE 754 special values “infinity”, “negative infinity”, and “not-a-number”, respectively. When writing these values as constants in an Cypher command, you do not put quotes around them, for example `MATCH (v) SET v.i = -Infinity`. On input, these strings are recognized in a case-sensitive manner. The infinity values can alternatively be spelled inf and `-inf`.

:::note
 IEEE 754 specifies that NaN should not compare equal to any other floating-point value (including NaN). In order to allow floating-point values to be sorted and used in tree-based indexes, PostgreSQL treats NaN values as equal, and greater than all non-NaN values.
:::

# Functions

## Abs()

abs() returns the absolute value of the given number.

### Syntax

`abs(expression)`

### Returns

`The type of the value returned will be that of expression.`

### Arguments
| Name |Description |
| :--- | :----: |
| expression | A numeric expression. |

### Considerations
 - abs(null) returns null.
 - If expression is negative, -(expression) (i.e. the negation of expression) is returned.

### Example 1. abs()

#### Query
```sql
SELECT * FROM cypher('numeric', $$
    MATCH (a), (e)
    WHERE a.name = 'Alice' AND e.name = 'Eskil'
    RETURN a.age, e.age, abs(a.age - e.age)
$$) as (a_age gtype, e_type, diff_age);
```
The absolute value of the age difference is returned.

#### Result
| a_age | e_age | diff_age |
| :--- | :----: | -----: |
| 38 | 41 | 3 |

## ceil()

ceil() returns the smallest floating point number that is greater than or equal to the given number and equal to a mathematical integer.

### Syntax:

`ceil(expression)`

### Returns:

`A Float.`

### Arguments:
| Name |Description |
| :--- | :----: |
| expression | A numeric expression. |

### Considerations:
 - ceil(null) returns null.

### Example 2. ceil()

#### Query
```sql
SELECT * FROM cypher('numeric', $$
RETURN ceil(0.1)
$$) as (ceil gtype);
```

The ceil of 0.1 is returned.

#### Result
| ceil |
| :--- |
| 1 |

## floor()

floor() returns the largest floating point number that is less than or equal to the given number and equal to a mathematical integer.

### Syntax

`floor(expression)`

### Returns

`A Float.`

### Arguments
| Name |Description |
| :--- | :----: |
| expression | A numeric expression. |

### Considerations
 - floor(null) returns null.

### Example 1. floor()

#### Query
```sql
SELECT * FROM cypher('numeric', $$
RETURN floor(0.9)
$$) as (ceil gtype);
```

The floor of 0.9 is returned.

#### Result
| floor |
| :--- |
| 0 |

## rand()

rand() returns a random floating point number in the range from 0 (inclusive) to 1 (exclusive); i.e. [0,1). The numbers returned follow an approximate uniform distribution.

### Syntax
`rand()`

### Returns
`A Float.`

### Example 1. rand()

#### Query
```sql
SELECT * FROM cypher('numeric', $$
RETURN rand()
$$) as (ceil gtype);
```

A random number is returned.

#### Result
| rand |
| :--- |
| 0.5460251846326871 |

## round()

round() returns the value of the given number rounded to the nearest integer, with ties always rounded towards positive infinity.

### Syntax
`round(expression)`

### Returns
`A Float.`

### Arguments
| Name |Description |
| :--- | :----: |
| expression | A numeric expression. |

### Considerations
 - round(null) returns null.

### Example 1. round()
#### Query
```sql
SELECT * FROM cypher('numeric', $$
RETURN round(3.141592)
$$) as (ceil gtype);
```

3.0 is returned.

#### Result
| rand |
| :--- |
| 3.0 |

## sign()

sign() returns the signum of the given number: 0 if the number is 0, -1 for any negative number, and 1 for any positive number.

### Syntax

`sign(expression)`

### Returns
`An Integer.`

### Arguments
| Name |Description |
| :--- | :----: |
| expression | A numeric expression. |

### Considerations
 - sign(null) returns null.

### Example 1. sign()

#### Query
```sql
SELECT * FROM cypher('numeric', $$
     RETURN sign(-17), sign(0.1)
$$) as (neg_sign gtype, pos_sign gtype);
```

The signs of -17 and 0.1 are returned.

#### Result
| neg_sign | pos_sign
| :--- | ---- |
| -1 | 1 |


